//══════════════════════════════════════════════════════════════════════════════════════════════════════//
//                                                                                                      //
//                                    𝗠𝗔𝗡𝗨-𝗠𝗗  𝐁𝐎𝐓                                                 //
//                                                                                                      //
//                                         Ｖ：7.0                                                       //

//███╗░░░███╗░█████╗░███╗░░██╗██╗░░░██╗
//████╗░████║██╔══██╗████╗░██║██║░░░██║
//██╔████╔██║███████║██╔██╗██║██║░░░██║
//██║╚██╔╝██║██╔══██║██║╚████║██║░░░██║
//██║░╚═╝░██║██║░░██║██║░╚███║╚██████╔╝
//╚═╝░░░░░╚═╝╚═╝░░╚═╝╚═╝░░╚══╝░╚═════╝░

//███╗░░░███╗██████╗░
//████╗░████║██╔══██╗
//██╔████╔██║██║░░██║
//██║╚██╔╝██║██║░░██║
//██║░╚═╝░██║██████╔╝
//╚═╝░░░░░╚═╝╚═════╝░

//══════════════════════════════════════════════════════════════════════════════════════════════════════//
//*
//  * @project_name : MANU-MD
//  * @author : Manul Official
//  * @youtube : https://www.youtube.com/@ManulOfficialTech
//  * @description : Manu-MD ,A Multi-functional whatsapp user bot.
//*
//*
//base by Manul Official
//GitHub: @manulofficial7
//WhatsApp: +94742274855
//want more free bot scripts? subscribe to my youtube channel: https://youtube.com/@ManulOfficialTech
//   * Created By Github: manulofficial7.
//   * Credit To Manul Official
//   * © 2024 MANU-MD-V7.
// ⛥┌┤
// */
var _0x381480=_0x40c6;(function(_0x42d79f,_0xd3ac9){var _0x18b7f4=_0x40c6,_0x449e16=_0x42d79f();while(!![]){try{var _0x4eece6=-parseInt(_0x18b7f4(0x191))/0x1*(parseInt(_0x18b7f4(0x1a1))/0x2)+-parseInt(_0x18b7f4(0x19e))/0x3+parseInt(_0x18b7f4(0x193))/0x4*(parseInt(_0x18b7f4(0x198))/0x5)+-parseInt(_0x18b7f4(0x19b))/0x6+parseInt(_0x18b7f4(0x192))/0x7+-parseInt(_0x18b7f4(0x199))/0x8+parseInt(_0x18b7f4(0x195))/0x9*(parseInt(_0x18b7f4(0x196))/0xa);if(_0x4eece6===_0xd3ac9)break;else _0x449e16['push'](_0x449e16['shift']());}catch(_0x40bf96){_0x449e16['push'](_0x449e16['shift']());}}}(_0x2228,0x2b942));function _0x40c6(_0x5bce3d,_0x3e3a52){var _0x2228ec=_0x2228();return _0x40c6=function(_0x40c65a,_0x4cb1be){_0x40c65a=_0x40c65a-0x191;var _0x191fa3=_0x2228ec[_0x40c65a];return _0x191fa3;},_0x40c6(_0x5bce3d,_0x3e3a52);}function _0x2228(){var _0x1f6b73=['\x31\x38\x56\x61\x58\x53\x75\x6d','\x34\x35\x36\x32\x33\x31\x30\x70\x72\x44\x59\x63\x6a','\x66\x72\x6f\x6d\x4d\x65','\x31\x30\x42\x62\x6e\x43\x76\x77','\x32\x33\x39\x30\x38\x35\x36\x64\x67\x70\x6e\x42\x6c','\x6d\x69\x73\x63','\x32\x30\x34\x35\x38\x36\x32\x62\x64\x77\x57\x49\x68','\x4e\x6f\x74\x20\x50\x72\x6f\x76\x69\x64\x65\x64','\x64\x6f\x6e\x74\x41\x64\x64\x43\x6f\x6d\x6d\x61\x6e\x64\x4c\x69\x73\x74','\x31\x30\x35\x33\x37\x32\x36\x4c\x78\x43\x47\x46\x63','\x66\x69\x6c\x65\x6e\x61\x6d\x65','\x66\x75\x6e\x63\x74\x69\x6f\x6e','\x36\x31\x34\x77\x44\x63\x43\x4c\x43','\x70\x75\x73\x68','\x64\x65\x73\x63','\x33\x32\x37\x4d\x77\x78\x57\x41\x6d','\x31\x37\x33\x35\x36\x38\x35\x77\x4f\x51\x4d\x45\x4b','\x32\x31\x39\x30\x39\x32\x71\x67\x55\x47\x68\x72','\x65\x78\x70\x6f\x72\x74\x73'];_0x2228=function(){return _0x1f6b73;};return _0x2228();}var commands=[];function cmd(_0x337f41,_0x4324a2){var _0x2ecb29=_0x40c6,_0x3ff9d4=_0x337f41;_0x3ff9d4[_0x2ecb29(0x1a0)]=_0x4324a2;if(!_0x3ff9d4[_0x2ecb29(0x19d)])_0x3ff9d4[_0x2ecb29(0x19d)]=![];if(!_0x337f41[_0x2ecb29(0x1a3)])_0x337f41[_0x2ecb29(0x1a3)]='';if(!_0x3ff9d4[_0x2ecb29(0x197)])_0x3ff9d4[_0x2ecb29(0x197)]=![];if(!_0x337f41['\x63\x61\x74\x65\x67\x6f\x72\x79'])_0x3ff9d4['\x63\x61\x74\x65\x67\x6f\x72\x79']=_0x2ecb29(0x19a);if(!_0x337f41[_0x2ecb29(0x19f)])_0x3ff9d4[_0x2ecb29(0x19f)]=_0x2ecb29(0x19c);return commands[_0x2ecb29(0x1a2)](_0x3ff9d4),_0x3ff9d4;}module[_0x381480(0x194)]={'\x63\x6d\x64':cmd,'\x41\x64\x64\x43\x6f\x6d\x6d\x61\x6e\x64':cmd,'\x46\x75\x6e\x63\x74\x69\x6f\x6e':cmd,'\x4d\x6f\x64\x75\x6c\x65':cmd,'\x63\x6f\x6d\x6d\x61\x6e\x64\x73':commands};