//══════════════════════════════════════════════════════════════════════════════════════════════════════//
//                                                                                                      //
//                                    𝗠𝗔𝗡𝗨-𝗠𝗗  𝐁𝐎𝐓                                                 //
//                                                                                                      //
//                                         Ｖ：7.0                                                       //

//███╗░░░███╗░█████╗░███╗░░██╗██╗░░░██╗
//████╗░████║██╔══██╗████╗░██║██║░░░██║
//██╔████╔██║███████║██╔██╗██║██║░░░██║
//██║╚██╔╝██║██╔══██║██║╚████║██║░░░██║
//██║░╚═╝░██║██║░░██║██║░╚███║╚██████╔╝
//╚═╝░░░░░╚═╝╚═╝░░╚═╝╚═╝░░╚══╝░╚═════╝░

//███╗░░░███╗██████╗░
//████╗░████║██╔══██╗
//██╔████╔██║██║░░██║
//██║╚██╔╝██║██║░░██║
//██║░╚═╝░██║██████╔╝
//╚═╝░░░░░╚═╝╚═════╝░

//══════════════════════════════════════════════════════════════════════════════════════════════════════//
//*
//  * @project_name : MANU-MD
//  * @author : Manul Official
//  * @youtube : https://www.youtube.com/@ManulOfficialTech
//  * @description : Manu-MD ,A Multi-functional whatsapp user bot.
//*
//*
//base by Manul Official
//GitHub: @manulofficial7
//WhatsApp: +94742274855
//want more free bot scripts? subscribe to my youtube channel: https://youtube.com/@ManulOfficialTech
//   * Created By Github: manulofficial7.
//   * Credit To Manul Official
//   * © 2024 MANU-MD-V7.
// ⛥┌┤
// */
function _0x224c(_0xa98da9,_0x132468){const _0x467295=_0x4672();return _0x224c=function(_0x224c13,_0x54ec8b){_0x224c13=_0x224c13-0x6d;let _0x398372=_0x467295[_0x224c13];return _0x398372;},_0x224c(_0xa98da9,_0x132468);}const _0x33b0e7=_0x224c;function _0x4672(){const _0x5ceae2=['\x32\x31\x35\x38\x38\x37\x7a\x7a\x70\x6c\x43\x68','\x32\x30\x30\x50\x6f\x65\x50\x6d\x6f','\x31\x34\x34\x35\x33\x31\x33\x4a\x6e\x65\x48\x56\x71','\x67\x72\x65\x65\x6e\x42\x72\x69\x67\x68\x74','\x39\x31\x35\x36\x30\x38\x46\x51\x62\x62\x7a\x4a','\x6b\x65\x79\x77\x6f\x72\x64','\x33\x39\x34\x39\x33\x30\x75\x43\x63\x76\x61\x50','\x32\x6f\x55\x64\x4d\x62\x68','\x6d\x61\x67\x65\x6e\x74\x61\x42\x72\x69\x67\x68\x74','\x62\x67\x4b\x65\x79\x77\x6f\x72\x64','\x32\x32\x34\x38\x32\x39\x37\x37\x64\x6f\x57\x50\x6f\x55','\x35\x55\x4a\x61\x4c\x4a\x69','\x39\x39\x6d\x4f\x53\x52\x66\x78','\x65\x78\x70\x6f\x72\x74\x73','\x67\x72\x65\x65\x6e','\x31\x30\x34\x31\x38\x38\x37\x43\x53\x51\x62\x7a\x72','\x5b\x20\x42\x4f\x54\x2d\x4d\x44\x20\x5d\x20','\x34\x31\x32\x32\x31\x30\x32\x4a\x4d\x4c\x44\x71\x6f'];_0x4672=function(){return _0x5ceae2;};return _0x4672();}(function(_0xaf16d0,_0x314f67){const _0x3cbd66=_0x224c,_0xf66dcb=_0xaf16d0();while(!![]){try{const _0x4ad273=-parseInt(_0x3cbd66(0x7a))/0x1+-parseInt(_0x3cbd66(0x72))/0x2*(parseInt(_0x3cbd66(0x6d))/0x3)+-parseInt(_0x3cbd66(0x6f))/0x4+-parseInt(_0x3cbd66(0x76))/0x5*(-parseInt(_0x3cbd66(0x7c))/0x6)+parseInt(_0x3cbd66(0x7d))/0x7*(-parseInt(_0x3cbd66(0x7e))/0x8)+-parseInt(_0x3cbd66(0x77))/0x9*(-parseInt(_0x3cbd66(0x71))/0xa)+parseInt(_0x3cbd66(0x75))/0xb;if(_0x4ad273===_0x314f67)break;else _0xf66dcb['push'](_0xf66dcb['shift']());}catch(_0xb53aa5){_0xf66dcb['push'](_0xf66dcb['shift']());}}}(_0x4672,0x9cae2));const chalk=require('\x63\x68\x61\x6c\x6b'),color=(_0xfc1ef8,_0x231556)=>{const _0x41130e=_0x224c;return!_0x231556?chalk[_0x41130e(0x79)](_0xfc1ef8):chalk[_0x41130e(0x70)](_0x231556)(_0xfc1ef8);},bgcolor=(_0x5b12f1,_0x2a9d66)=>{const _0x3a5a02=_0x224c;return!_0x2a9d66?chalk[_0x3a5a02(0x79)](_0x5b12f1):chalk[_0x3a5a02(0x74)](_0x2a9d66)(_0x5b12f1);},mycolor=(_0x25e65f,_0x3f91ef)=>{const _0x373b56=_0x224c;return!_0x3f91ef?chalk[_0x373b56(0x6e)](_0x373b56(0x7b))+chalk[_0x373b56(0x73)](_0x25e65f):chalk[_0x373b56(0x6e)](_0x373b56(0x7b))+chalk[_0x373b56(0x70)](_0x3f91ef)(_0x25e65f);};module[_0x33b0e7(0x78)]={'\x63\x6f\x6c\x6f\x72':color,'\x62\x67\x63\x6f\x6c\x6f\x72':bgcolor,'\x6d\x79\x63\x6f\x6c\x6f\x72':mycolor};