//══════════════════════════════════════════════════════════════════════════════════════════════════════//
//                                                                                                      //
//                                    𝗠𝗔𝗡𝗨-𝗠𝗗  𝐁𝐎𝐓                                                 //
//                                                                                                      //
//                                         Ｖ：7.0                                                       //

//███╗░░░███╗░█████╗░███╗░░██╗██╗░░░██╗
//████╗░████║██╔══██╗████╗░██║██║░░░██║
//██╔████╔██║███████║██╔██╗██║██║░░░██║
//██║╚██╔╝██║██╔══██║██║╚████║██║░░░██║
//██║░╚═╝░██║██║░░██║██║░╚███║╚██████╔╝
//╚═╝░░░░░╚═╝╚═╝░░╚═╝╚═╝░░╚══╝░╚═════╝░

//███╗░░░███╗██████╗░
//████╗░████║██╔══██╗
//██╔████╔██║██║░░██║
//██║╚██╔╝██║██║░░██║
//██║░╚═╝░██║██████╔╝
//╚═╝░░░░░╚═╝╚═════╝░

//══════════════════════════════════════════════════════════════════════════════════════════════════════//
//*
//  * @project_name : MANU-MD
//  * @author : Manul Official
//  * @youtube : https://www.youtube.com/@ManulOfficialTech
//  * @description : Manu-MD ,A Multi-functional whatsapp user bot.
//*
//*
//base by Manul Official
//GitHub: @manulofficial7
//WhatsApp: +94742274855
//want more free bot scripts? subscribe to my youtube channel: https://youtube.com/@ManulOfficialTech
//   * Created By Github: manulofficial7.
//   * Credit To Manul Official
//   * © 2024 MANU-MD-V7.
// ⛥┌┤
// */
const _0x4641fb=_0x3e8a;(function(_0x4217a8,_0x44700a){const _0x124671=_0x3e8a,_0x56646b=_0x4217a8();while(!![]){try{const _0x2ed89d=parseInt(_0x124671(0x144))/0x1*(parseInt(_0x124671(0x143))/0x2)+parseInt(_0x124671(0x154))/0x3*(-parseInt(_0x124671(0x151))/0x4)+-parseInt(_0x124671(0x150))/0x5+parseInt(_0x124671(0x140))/0x6*(parseInt(_0x124671(0x14c))/0x7)+parseInt(_0x124671(0x13d))/0x8*(-parseInt(_0x124671(0x142))/0x9)+-parseInt(_0x124671(0x141))/0xa+parseInt(_0x124671(0x155))/0xb;if(_0x2ed89d===_0x44700a)break;else _0x56646b['push'](_0x56646b['shift']());}catch(_0x12f322){_0x56646b['push'](_0x56646b['shift']());}}}(_0x1d8e,0xc4702));const fetch=(..._0x39ac5b)=>import(_0x4641fb(0x13e))[_0x4641fb(0x152)](({default:_0x44282e})=>_0x44282e(..._0x39ac5b)),file_size_url=(..._0x329d61)=>import(_0x4641fb(0x13c))[_0x4641fb(0x152)](({default:_0x333b2c})=>_0x333b2c(..._0x329d61)),cheerio=require(_0x4641fb(0x14d)),tools=require('\x2e\x2f\x63\x6f\x6e\x66\x69\x67\x2e\x6a\x73');async function search(_0x3a8512){const _0x66a18=_0x4641fb;let _0x3fca15=await fetch(tools[_0x66a18(0x149)](0x5,_0x66a18(0x14b),{'\x71\x75\x65\x72\x79':_0x3a8512,'\x6c\x69\x6d\x69\x74':0x3e8})),_0x215676={};return _0x3fca15=await _0x3fca15['\x6a\x73\x6f\x6e'](),_0x215676=_0x3fca15[_0x66a18(0x14f)][_0x66a18(0x14a)][_0x66a18(0x145)](_0xa8fefc=>{const _0x1832b5=_0x66a18;return{'\x6e\x61\x6d\x65':_0xa8fefc[_0x1832b5(0x153)],'\x69\x64':_0xa8fefc[_0x1832b5(0x148)]};}),_0x215676;}function _0x1d8e(){const _0x3b4fbd=['\x70\x61\x63\x6b\x61\x67\x65','\x61\x70\x69','\x6c\x69\x73\x74','\x2f\x61\x70\x70\x73\x2f\x73\x65\x61\x72\x63\x68','\x33\x34\x33\x67\x4f\x55\x79\x42\x59','\x63\x68\x65\x65\x72\x69\x6f','\x69\x63\x6f\x6e','\x64\x61\x74\x61\x6c\x69\x73\x74','\x37\x39\x33\x34\x39\x36\x30\x73\x46\x4f\x62\x49\x77','\x33\x32\x37\x38\x39\x30\x30\x67\x64\x54\x56\x6a\x45','\x74\x68\x65\x6e','\x6e\x61\x6d\x65','\x33\x58\x43\x64\x47\x64\x71','\x33\x32\x36\x38\x39\x36\x36\x38\x62\x4e\x47\x75\x49\x58','\x66\x69\x6c\x65\x5f\x73\x69\x7a\x65\x5f\x75\x72\x6c','\x32\x34\x56\x63\x53\x50\x58\x6d','\x6e\x6f\x64\x65\x2d\x66\x65\x74\x63\x68','\x65\x78\x70\x6f\x72\x74\x73','\x31\x33\x39\x31\x33\x34\x4e\x6c\x46\x4f\x61\x64','\x34\x37\x31\x32\x35\x33\x30\x49\x56\x43\x6f\x63\x73','\x32\x38\x33\x32\x30\x33\x39\x6b\x71\x4d\x69\x6e\x46','\x36\x32\x34\x67\x44\x68\x46\x73\x75','\x31\x36\x36\x32\x47\x55\x6f\x55\x52\x72','\x6d\x61\x70','\x70\x61\x74\x68','\x66\x69\x6c\x65'];_0x1d8e=function(){return _0x3b4fbd;};return _0x1d8e();}async function download(_0x8af7f8){const _0x5424ad=_0x4641fb;let _0x13fbbb=await fetch(tools[_0x5424ad(0x149)](0x5,_0x5424ad(0x14b),{'\x71\x75\x65\x72\x79':_0x8af7f8,'\x6c\x69\x6d\x69\x74':0x1}));_0x13fbbb=await _0x13fbbb['\x6a\x73\x6f\x6e']();let _0x1c584a=_0x13fbbb['\x64\x61\x74\x61\x6c\x69\x73\x74'][_0x5424ad(0x14a)][0x0][_0x5424ad(0x153)],_0x414d4e=_0x13fbbb[_0x5424ad(0x14f)][_0x5424ad(0x14a)][0x0][_0x5424ad(0x148)],_0x451873=_0x13fbbb['\x64\x61\x74\x61\x6c\x69\x73\x74'][_0x5424ad(0x14a)][0x0][_0x5424ad(0x14e)],_0x10e24f=_0x13fbbb[_0x5424ad(0x14f)][_0x5424ad(0x14a)][0x0][_0x5424ad(0x147)][_0x5424ad(0x146)],_0x1b4600=_0x13fbbb[_0x5424ad(0x14f)]['\x6c\x69\x73\x74'][0x0]['\x75\x70\x64\x61\x74\x65\x64'],_0xd9c48b=await file_size_url(_0x10e24f);return{'\x6e\x61\x6d\x65':_0x1c584a,'\x6c\x61\x73\x74\x75\x70':_0x1b4600,'\x70\x61\x63\x6b\x61\x67\x65':_0x414d4e,'\x73\x69\x7a\x65':_0xd9c48b,'\x69\x63\x6f\x6e':_0x451873,'\x64\x6c\x6c\x69\x6e\x6b':_0x10e24f};}function _0x3e8a(_0x23086f,_0xb87d85){const _0x1d8e7a=_0x1d8e();return _0x3e8a=function(_0x3e8af7,_0x2204bb){_0x3e8af7=_0x3e8af7-0x13c;let _0x376afd=_0x1d8e7a[_0x3e8af7];return _0x376afd;},_0x3e8a(_0x23086f,_0xb87d85);}module[_0x4641fb(0x13f)]={'\x73\x65\x61\x72\x63\x68':search,'\x64\x6f\x77\x6e\x6c\x6f\x61\x64':download};