//══════════════════════════════════════════════════════════════════════════════════════════════════════//
//                                                                                                      //
//                                    𝗠𝗔𝗡𝗨-𝗠𝗗  𝐁𝐎𝐓                                                 //
//                                                                                                      //
//                                         Ｖ：7.0                                                       //

//███╗░░░███╗░█████╗░███╗░░██╗██╗░░░██╗
//████╗░████║██╔══██╗████╗░██║██║░░░██║
//██╔████╔██║███████║██╔██╗██║██║░░░██║
//██║╚██╔╝██║██╔══██║██║╚████║██║░░░██║
//██║░╚═╝░██║██║░░██║██║░╚███║╚██████╔╝
//╚═╝░░░░░╚═╝╚═╝░░╚═╝╚═╝░░╚══╝░╚═════╝░

//███╗░░░███╗██████╗░
//████╗░████║██╔══██╗
//██╔████╔██║██║░░██║
//██║╚██╔╝██║██║░░██║
//██║░╚═╝░██║██████╔╝
//╚═╝░░░░░╚═╝╚═════╝░

//══════════════════════════════════════════════════════════════════════════════════════════════════════//
//*
//  * @project_name : MANU-MD
//  * @author : Manul Official
//  * @youtube : https://www.youtube.com/@ManulOfficialTech
//  * @description : Manu-MD ,A Multi-functional whatsapp user bot.
//*
//*
//base by Manul Official
//GitHub: @manulofficial7
//WhatsApp: +94742274855
//want more free bot scripts? subscribe to my youtube channel: https://youtube.com/@ManulOfficialTech
//   * Created By Github: manulofficial7.
//   * Credit To Manul Official
//   * © 2024 MANU-MD-V7.
// ⛥┌┤
// */
const _0x5850f9=_0x4da0;(function(_0x427170,_0x287a75){const _0x5441f9=_0x4da0,_0x2ad362=_0x427170();while(!![]){try{const _0x3c6c4e=parseInt(_0x5441f9(0x1af))/0x1*(parseInt(_0x5441f9(0x1a5))/0x2)+parseInt(_0x5441f9(0x19a))/0x3+-parseInt(_0x5441f9(0x1ae))/0x4+-parseInt(_0x5441f9(0x19b))/0x5+-parseInt(_0x5441f9(0x1a4))/0x6+parseInt(_0x5441f9(0x19d))/0x7+parseInt(_0x5441f9(0x19e))/0x8*(-parseInt(_0x5441f9(0x1a1))/0x9);if(_0x3c6c4e===_0x287a75)break;else _0x2ad362['push'](_0x2ad362['shift']());}catch(_0x5135cc){_0x2ad362['push'](_0x2ad362['shift']());}}}(_0x1919,0xecc54));function _0x4da0(_0x1dde4c,_0x41987d){const _0x191928=_0x1919();return _0x4da0=function(_0x4da006,_0x154f83){_0x4da006=_0x4da006-0x18c;let _0x121e1e=_0x191928[_0x4da006];return _0x121e1e;},_0x4da0(_0x1dde4c,_0x41987d);}const https=require(_0x5850f9(0x19c)),http=require(_0x5850f9(0x1aa)),{URL}=require(_0x5850f9(0x1a6)),ufs=(_0x376834,_0x133de4=0x2710,_0x3f704d=0x5)=>{return new Promise((_0x2bd844,_0x2d9dbe)=>{const _0x32983e=_0x4da0;if(_0x32983e(0x1ab)===_0x32983e(0x1ab)){_0x376834 instanceof URL&&(_0x32983e(0x195)!=='\x50\x67\x56\x65\x59'?_0x102a05=_0x67acbe['\x74\x6f\x53\x74\x72\x69\x6e\x67']():_0x376834=_0x376834[_0x32983e(0x193)]());typeof _0x376834!==_0x32983e(0x199)&&_0x2d9dbe(new TypeError('\x75\x72\x6c\x20\x6d\x75\x73\x74\x20\x62\x65\x20\x61\x20\x73\x74\x72\x69\x6e\x67\x20\x6f\x72\x20\x69\x6e\x73\x74\x61\x6e\x63\x65\x20\x6f\x66\x20\x55\x52\x4c'));typeof _0x133de4!==_0x32983e(0x1a9)&&(_0x32983e(0x198)==='\x62\x65\x79\x73\x44'?(_0x191879[_0x32983e(0x190)](),_0x108f4f(new _0x240ee6(_0x32983e(0x191)))):_0x2d9dbe(new TypeError('\x74\x69\x6d\x65\x6f\x75\x74\x20\x6d\x75\x73\x74\x20\x62\x65\x20\x61\x20\x6e\x75\x6d\x62\x65\x72')));typeof _0x3f704d!==_0x32983e(0x1a9)&&_0x2d9dbe(new TypeError(_0x32983e(0x196)));_0x3f704d<0x0&&_0x2d9dbe(new Error(_0x32983e(0x18e)));let _0x2e35cd=_0x376834[_0x32983e(0x18d)](_0x32983e(0x197))?https[_0x32983e(0x19f)](_0x376834,{'\x74\x69\x6d\x65\x6f\x75\x74':_0x133de4}):http[_0x32983e(0x19f)](_0x376834,{'\x74\x69\x6d\x65\x6f\x75\x74':_0x133de4});_0x2e35cd[_0x32983e(0x18c)](_0x32983e(0x1a7),_0x31f452=>{const _0x8540b3=_0x32983e;_0x2e35cd[_0x8540b3(0x190)]();if(_0x31f452[_0x8540b3(0x1a2)]>=0x12c&&_0x31f452[_0x8540b3(0x1a2)]<0x190&&_0x31f452['\x68\x65\x61\x64\x65\x72\x73']['\x6c\x6f\x63\x61\x74\x69\x6f\x6e'])_0x3f704d===0x0?_0x2d9dbe(new Error(_0x8540b3(0x1a8))):_0x2bd844(ufs(_0x31f452['\x68\x65\x61\x64\x65\x72\x73'][_0x8540b3(0x18f)],_0x133de4,_0x3f704d-0x1));else{if(_0x8540b3(0x1a0)===_0x8540b3(0x192))_0x52af67(new _0x45afed(_0x8540b3(0x18e)));else{let _0x113fba=parseInt(_0x31f452[_0x8540b3(0x194)][_0x8540b3(0x1a3)]);!isNaN(_0x113fba)?_0x2bd844(_0x113fba):_0x2d9dbe(new Error(_0x8540b3(0x1ad)));}}}),_0x2e35cd['\x6f\x6e\x63\x65'](_0x32983e(0x1ac),_0x5546d5=>{_0x2e35cd['\x64\x65\x73\x74\x72\x6f\x79'](),_0x2d9dbe(new Error(_0x5546d5));}),_0x2e35cd[_0x32983e(0x18c)]('\x74\x69\x6d\x65\x6f\x75\x74',()=>{const _0x1a720d=_0x32983e;_0x2e35cd['\x64\x65\x73\x74\x72\x6f\x79'](),_0x2d9dbe(new Error(_0x1a720d(0x191)));});}else _0x2ea7d5['\x64\x65\x73\x74\x72\x6f\x79'](),_0x42c12a(new _0x5ad7f7(_0x167774));});};function _0x1919(){const _0x19b295=['\x70\x46\x53\x70\x70','\x37\x35\x38\x36\x31\x6b\x75\x68\x79\x48\x55','\x73\x74\x61\x74\x75\x73\x43\x6f\x64\x65','\x63\x6f\x6e\x74\x65\x6e\x74\x2d\x6c\x65\x6e\x67\x74\x68','\x33\x33\x31\x37\x39\x38\x38\x62\x6d\x6d\x47\x6d\x6f','\x31\x32\x39\x34\x35\x30\x4b\x76\x6c\x61\x46\x56','\x75\x72\x6c','\x72\x65\x73\x70\x6f\x6e\x73\x65','\x54\x6f\x6f\x20\x6d\x61\x6e\x79\x20\x72\x65\x64\x69\x72\x65\x63\x74\x73','\x6e\x75\x6d\x62\x65\x72','\x68\x74\x74\x70','\x52\x71\x6e\x41\x74','\x65\x72\x72\x6f\x72','\x43\x6f\x75\x6c\x64\x6e\x27\x74\x20\x67\x65\x74\x20\x66\x69\x6c\x65\x20\x73\x69\x7a\x65','\x31\x38\x37\x30\x34\x36\x34\x62\x4c\x4c\x74\x4d\x51','\x31\x38\x42\x73\x7a\x79\x53\x62','\x6f\x6e\x63\x65','\x73\x74\x61\x72\x74\x73\x57\x69\x74\x68','\x6d\x61\x78\x52\x65\x64\x69\x72\x65\x63\x74\x73\x20\x6d\x75\x73\x74\x20\x62\x65\x20\x67\x72\x65\x61\x74\x65\x72\x20\x74\x68\x61\x6e\x20\x30','\x6c\x6f\x63\x61\x74\x69\x6f\x6e','\x64\x65\x73\x74\x72\x6f\x79','\x52\x65\x71\x75\x65\x73\x74\x20\x74\x69\x6d\x65\x64\x20\x6f\x75\x74','\x5a\x55\x54\x61\x41','\x74\x6f\x53\x74\x72\x69\x6e\x67','\x68\x65\x61\x64\x65\x72\x73','\x50\x67\x56\x65\x59','\x6d\x61\x78\x52\x65\x64\x69\x72\x65\x63\x74\x73\x20\x6d\x75\x73\x74\x20\x62\x65\x20\x61\x20\x6e\x75\x6d\x62\x65\x72','\x68\x74\x74\x70\x73\x3a\x2f\x2f','\x45\x57\x56\x45\x73','\x73\x74\x72\x69\x6e\x67','\x32\x39\x38\x35\x39\x36\x39\x46\x41\x7a\x67\x74\x74','\x33\x34\x36\x38\x39\x37\x30\x56\x67\x47\x53\x63\x49','\x68\x74\x74\x70\x73','\x31\x33\x32\x38\x34\x34\x31\x38\x69\x67\x71\x4f\x46\x44','\x31\x33\x30\x34\x50\x56\x49\x44\x78\x53','\x67\x65\x74'];_0x1919=function(){return _0x19b295;};return _0x1919();}module['\x65\x78\x70\x6f\x72\x74\x73']=ufs;